In [2]:
import pandas as pd

In [71]:
data=pd.read_csv(r"C:\Users\USER\Downloads\test2.csv")
data

   Unnamed: 0     Name   Age Department   Salary
0           0    Alice  25.0         HR  50000.0
1           1      Bob  30.0         IT  60000.0
2           2  Charlie  35.0    Finance  70000.0
3           3    David   NaN         IT  62000.0
4           4      Eve  29.0         HR      NaN
5           5    Alice  25.0         HR  50000.0

In [72]:
data.isnull().sum

<bound method DataFrame.sum of    Unnamed: 0   Name    Age  Department  Salary
0       False  False  False       False   False
1       False  False  False       False   False
2       False  False  False       False   False
3       False  False   True       False   False
4       False  False  False       False    True
5       False  False  False       False   False>

In [8]:
data.loc[ : ,"Name":"Age"]

      Name   Age
0    Alice  25.0
1      Bob  30.0
2  Charlie  35.0
3    David   NaN
4      Eve  29.0
5    Alice  25.0

In [10]:
data.loc[1:3,"Name":"Department"]

      Name   Age Department
1      Bob  30.0         IT
2  Charlie  35.0    Finance
3    David   NaN         IT

In [11]:
data.iloc[1:4,1:4]

      Name   Age Department
1      Bob  30.0         IT
2  Charlie  35.0    Finance
3    David   NaN         IT

In [14]:
data.rename(columns={"Name":"MD"})

   Unnamed: 0       MD   Age Department   Salary
0           0    Alice  25.0         HR  50000.0
1           1      Bob  30.0         IT  60000.0
2           2  Charlie  35.0    Finance  70000.0
3           3    David   NaN         IT  62000.0
4           4      Eve  29.0         HR      NaN
5           5    Alice  25.0         HR  50000.0

In [16]:
data.rename(columns={"Name":"MD"},inplace=True)
data

   Unnamed: 0       MD   Age Department   Salary
0           0    Alice  25.0         HR  50000.0
1           1      Bob  30.0         IT  60000.0
2           2  Charlie  35.0    Finance  70000.0
3           3    David   NaN         IT  62000.0
4           4      Eve  29.0         HR      NaN
5           5    Alice  25.0         HR  50000.0

In [22]:
data.drop('Unnamed: 0',axis=1,inplace=True)

In [23]:
data

        MD   Age Department   Salary
0    Alice  25.0         HR  50000.0
1      Bob  30.0         IT  60000.0
2  Charlie  35.0    Finance  70000.0
3    David   NaN         IT  62000.0
4      Eve  29.0         HR      NaN
5    Alice  25.0         HR  50000.0

In [42]:
data["updated_salary"] = data["Salary"] + 5000
data

        MD   Age Department   Salary  updated_salary
0    Alice  25.0         HR  50000.0         55000.0
1      Bob  30.0         IT  60000.0         65000.0
2  Charlie  35.0    Finance  70000.0         75000.0
3    David   NaN         IT  62000.0         67000.0
4      Eve  29.0         HR      NaN             NaN
5    Alice  25.0         HR  50000.0         55000.0

In [45]:
data["Updated_Salary"] = data["Salary"].map(lambda x: x + 10000)
data

        MD   Age Department   Salary  updated_salary  Updated_Salary
0    Alice  25.0         HR  50000.0         55000.0         60000.0
1      Bob  30.0         IT  60000.0         65000.0         70000.0
2  Charlie  35.0    Finance  70000.0         75000.0         80000.0
3    David   NaN         IT  62000.0         67000.0         72000.0
4      Eve  29.0         HR      NaN             NaN             NaN
5    Alice  25.0         HR  50000.0         55000.0         60000.0

In [73]:
data.isnull().sum()

Unnamed: 0    0
Name          0
Age           1
Department    0
Salary        1
dtype: int64

In [75]:
data["Age"] = data["Age"].fillna(value = data["Age"].mean())

In [76]:
data

   Unnamed: 0     Name   Age Department   Salary
0           0    Alice  25.0         HR  50000.0
1           1      Bob  30.0         IT  60000.0
2           2  Charlie  35.0    Finance  70000.0
3           3    David  28.8         IT  62000.0
4           4      Eve  29.0         HR      NaN
5           5    Alice  25.0         HR  50000.0

In [78]:
data["Salary"] = data["Salary"].fillna(value = data["Salary"].mean())

In [79]:
data

   Unnamed: 0     Name   Age Department   Salary
0           0    Alice  25.0         HR  50000.0
1           1      Bob  30.0         IT  60000.0
2           2  Charlie  35.0    Finance  70000.0
3           3    David  28.8         IT  62000.0
4           4      Eve  29.0         HR  58400.0
5           5    Alice  25.0         HR  50000.0

In [80]:
data.Age.ffill()

0    25.0
1    30.0
2    35.0
3    28.8
4    29.0
5    25.0
Name: Age, dtype: float64

In [82]:
data["Updated_salary"]=data["Salary"].apply(lambda x:x+500)

In [83]:
data

   Unnamed: 0     Name   Age Department   Salary  Updated_salary
0           0    Alice  25.0         HR  50000.0         50500.0
1           1      Bob  30.0         IT  60000.0         60500.0
2           2  Charlie  35.0    Finance  70000.0         70500.0
3           3    David  28.8         IT  62000.0         62500.0
4           4      Eve  29.0         HR  58400.0         58900.0
5           5    Alice  25.0         HR  50000.0         50500.0

In [85]:
data["level"] = data.apply(lambda s:"High" if s["Updated_salary"] > 60000 else "Low" ,axis =1 )

In [86]:
data

   Unnamed: 0     Name   Age Department   Salary  Updated_salary level
0           0    Alice  25.0         HR  50000.0         50500.0   Low
1           1      Bob  30.0         IT  60000.0         60500.0  High
2           2  Charlie  35.0    Finance  70000.0         70500.0  High
3           3    David  28.8         IT  62000.0         62500.0  High
4           4      Eve  29.0         HR  58400.0         58900.0   Low
5           5    Alice  25.0         HR  50000.0         50500.0   Low

In [89]:
data.groupby("Department")["Salary"].mean()

Department
Finance    70000.0
HR         52800.0
IT         61000.0
Name: Salary, dtype: float64